app/controllers/game_controller.rb

INSERT INTO "players" ("color", "created_at", "game_id", "last_request", "session_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT "players".* FROM "players" WHERE "players"."session_token" = 'QPStnzj1hGGTke1fDwnbng' LIMIT 1
UPDATE "players" SET "last_request" = '2013-11-21 20:18:58.825455', "updated_at" = '2013-11-21 20:18:58.826220' WHERE "players"."id" = 1
SELECT "players".* FROM "players" WHERE (last_request > '2013-11-21 21:45:31.864261' AND game_id IS NULL) LIMIT 1
SELECT COUNT(*) FROM "players" WHERE (last_request > '2013-11-21 20:18:28.829608' AND game_id IS NULL)
INSERT INTO "games" ("black_id", "board", "created_at", "turn", "updated_at", "white_id") VALUES (?, ?, ?, ?, ?, ?)  [["black_id", 1], ["board", ""], ["created_at", Mon, 25 Nov 2013 18:12:12 UTC +00:00], ["turn", :white], ["updated_at", Mon, 25 Nov 2013 18:12:12 UTC +00:00], ["white_id", 2]]
---
  def find
    player = nil
    if session[:token].nil?
      player = Player.create
      session[:token] = player.session_token
    else
      player = Player.find_by_session_token(session[:token])
    end
    unless player.nil?
      player.last_request = Time.now
      player.save
      if player.game_id.nil?
        time_before_expires = 30.seconds.ago
        players = Player.where("last_request > ? AND game_id IS NULL", time_before_expires)
        if players.count >= 2
          game = Game.create(black_id: players.first.id, white_id: players.second.id, turn: :white, board: "")

SELECT "players".* FROM "players" WHERE "players"."session_token" IS NULL LIMIT 1
---
  def move
    player = Player.find_by_session_token(session[:token])